%目标函数所对应的设计变量的系数
c=[20;12;33;26;22;15;29;23;21;13;31;24;22;16;32;23];
%等式约束
Aeq=[1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0;
     0 0 0 0 1 1 1 1 0 0 0 0 0 0 0 0;
     0 0 0 0 0 0 0 0 1 1 1 1 0 0 0 0;
     0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1;
     1 0 0 0 1 0 0 0 1 0 0 0 1 0 0 0;
     0 1 0 0 0 1 0 0 0 1 0 0 0 1 0 0;
     0 0 1 0 0 0 1 0 0 0 1 0 0 0 1 0;
     0 0 0 1 0 0 0 1 0 0 0 1 0 0 0 1;
     ];
 beq=ones(1,8);
 %求最优解x和目标函数在x处的值fval
 [x,fval]=bintprog(c,[],[],Aeq,beq);
 %由于x是一列元素，为了使结果更加直观，故排成与效率矩阵E相对应的形式
 B=reshape(x,4,4);
 B'
 fval
