%目标函数所对应的设计变量的系数
c=[500;500;500;500;10;10;10;10;20000;20000;20000;20000];
%不等式约束
A=[1 0 0 0 0 0 0 0 -20000 0 0 0;
   0 1 0 0 0 0 0 0 0 -20000 0 0;
   0 0 1 0 0 0 0 0 0 0 -20000 0;
   0 0 0 1 0 0 0 0 0 0 0 -20000];
b=[0;0;0;0];
%等式约束
Aeq=[ 1 0 0 0 -1 0 0 0 0 0 0 0;
      0 1 0 0 1 -1 0 0 0 0 0 0;
      0 0 1 0 0 1 -1 0 0 0 0 0;
      0 0 0 1 0 0 1 -1 0 0 0 0];
beq=[1500;2000;4000;1000];
%设计变量的边界约束，其中设置0-1型变量的上界为1
lb=zeros(1,12);
ub=[Inf;Inf;Inf;Inf;Inf;Inf;Inf;Inf;1;1;1;1];
%要求所有变量均为整数，故将所有序号构成向量M
M=1:12;
Tol=1e-8;
%求最优解x和在x处的函数值fval
[x,fval]=intprog(c,A,b,Aeq,beq,lb,ub,M,Tol)
